# Задача №1
# Напишите программу вычисления арифметического выражения заданного строкой. 
# Используйте операции +,-,/,*. приоритет операций стандартный.

# *Пример:*

# 2+2 => 4;

# 1+2*3 => 7;

# 1-2*3 => -5;

a = eval("2+2")
b = eval("1+2*3")
c = eval("1-2*3")
print(a)
print(b)
print(c)
